Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg2_hs_host.h
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT3 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT3_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT3_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT3_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT3_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT3_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT3_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT3_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT3_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT3_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT3_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT3_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK3 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_XFRCM     (0x1U<<0)

// OTG_HS_HCTSIZ3 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA3 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA3_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA3_DMAADDR_0    (0x1U<<0)

// OTG_HS_HCCHAR4 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR4_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR4_MPSIZ_0     (0x1U<<0)

// OTG_HS_HCSPLT4 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT4_SPLITEN     (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT4_COMPLSPLT   (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT4_XACTPOS     (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT4_XACTPOS_0   (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT4_HUBADDR     (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT4_HUBADDR_0   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT4_PRTADDR     (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT4_PRTADDR_0   (0x1U<<0)

// OTG_HS_HCINT4 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT4_DTERR        (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT4_FRMOR        (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT4_BBERR        (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT4_TXERR        (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT4_NYET         (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT4_ACK          (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT4_NAK          (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT4_STALL        (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT4_AHBERR       (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT4_CHH          (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT4_XFRC         (0x1U<<0)

// OTG_HS_HCINTMSK4 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_DTERRM    (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_FRMORM    (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_BBERRM    (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_TXERRM    (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_NYET      (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_ACKM      (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_NAKM      (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_STALLM    (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_AHBERR    (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_CHHM      (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK4_XFRCM     (0x1U<<0)

// OTG_HS_HCTSIZ4 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_DPID        (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_DPID_0      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_PKTCNT      (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_PKTCNT_0    (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_XFRSIZ      (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ4_XFRSIZ_0    (0x1U<<0)

// OTG_HS_HCDMA4 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA4_DMAADDR      (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA4_DMAADDR_0    (0x1U<<0)

// OTG_HS_HCCHAR5 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR5_CHENA       (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_CHDIS       (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_ODDFRM      (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_DAD         (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_DAD_0       (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_MC          (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_MC_0        (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPTYP       (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPTYP_0     (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_LSDEV       (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPDIR       (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPNUM       (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_EPNUM_0     (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_MPSIZ       (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR5_MPSIZ_0     (0x1U<<0)

// OTG_HS_HCSPLT5 Configuration

