Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg2_hs_host.h
// OTG_HS_HCCHAR10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR10_CHENA      (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_CHDIS      (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_ODDFRM     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_DAD        (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_DAD_0      (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MC         (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MC_0       (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPTYP      (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPTYP_0    (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_LSDEV      (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPDIR      (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPNUM      (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPNUM_0    (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MPSIZ      (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MPSIZ_0    (0x1U<<0)

// OTG_HS_HCSPLT10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT10_SPLITEN    (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_COMPLSPLT  (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_XACTPOS    (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_XACTPOS_0  (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_HUBADDR    (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_HUBADDR_0  (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_PRTADDR    (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_PRTADDR_0  (0x1U<<0)

// OTG_HS_HCINT10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT10_DTERR       (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT10_FRMOR       (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT10_BBERR       (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT10_TXERR       (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT10_NYET        (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT10_ACK         (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT10_NAK         (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT10_STALL       (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT10_AHBERR      (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT10_CHH         (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT10_XFRC        (0x1U<<0)

// OTG_HS_HCINTMSK10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_DTERRM   (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_FRMORM   (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_BBERRM   (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_TXERRM   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_NYET     (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_ACKM     (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_NAKM     (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_STALLM   (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_AHBERR   (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_CHHM     (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_XFRCM    (0x1U<<0)

// OTG_HS_HCTSIZ10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_DPID       (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_DPID_0     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT     (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT_0   (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ     (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ_0   (0x1U<<0)

// OTG_HS_HCDMA10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA10_DMAADDR     (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA10_DMAADDR_0   (0x1U<<0)

// OTG_HS_HCCHAR11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR11_CHENA      (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_CHDIS      (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_ODDFRM     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_DAD        (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_DAD_0      (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MC         (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MC_0       (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPTYP      (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPTYP_0    (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_LSDEV      (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPDIR      (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPNUM      (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPNUM_0    (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MPSIZ      (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MPSIZ_0    (0x1U<<0)

// OTG_HS_HCSPLT11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT11_SPLITEN    (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT  (0x1U<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_XACTPOS    (0x3U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_XACTPOS_0  (0x1U<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_HUBADDR    (0x7FU<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_HUBADDR_0  (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_PRTADDR    (0x7FU<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_PRTADDR_0  (0x1U<<0)

// OTG_HS_HCINT11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT11_DTERR       (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT11_FRMOR       (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT11_BBERR       (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT11_TXERR       (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT11_NYET        (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT11_ACK         (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT11_NAK         (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT11_STALL       (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT11_AHBERR      (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT11_CHH         (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT11_XFRC        (0x1U<<0)

// OTG_HS_HCINTMSK11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_DTERRM   (0x1U<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_FRMORM   (0x1U<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_BBERRM   (0x1U<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_TXERRM   (0x1U<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_NYET     (0x1U<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_ACKM     (0x1U<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_NAKM     (0x1U<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_STALLM   (0x1U<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_AHBERR   (0x1U<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_CHHM     (0x1U<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_XFRCM    (0x1U<<0)

// OTG_HS_HCTSIZ11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_DPID       (0x3U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_DPID_0     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT     (0x3FFU<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT_0   (0x1U<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ     (0x7FFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ_0   (0x1U<<0)

// OTG_HS_HCDMA11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA11_DMAADDR     (0xFFFFFFFFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA11_DMAADDR_0   (0x1U<<0)

// OTG_HS_HCCHAR12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR12_CHENA      (0x1U<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_CHDIS      (0x1U<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_ODDFRM     (0x1U<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_DAD        (0x7FU<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_DAD_0      (0x1U<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_MC         (0x3U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_MC_0       (0x1U<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPTYP      (0x3U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPTYP_0    (0x1U<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_LSDEV      (0x1U<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPDIR      (0x1U<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPNUM      (0xFU<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPNUM_0    (0x1U<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_MPSIZ      (0x7FFU<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_MPSIZ_0    (0x1U<<0)

